#+TITLE: Brewfile
#+property: header-args :results verbatim

* Brewfile - [[https://github.com/Homebrew/homebrew-bundle][homebrew-bundle]]
  
** Core packages - [[https://brew.sh/][brew.sh]]
   :PROPERTIES:
   :CUSTOM_ID: brewfile-core
   :END:

   Essential packages can be installed with:
    
   #+begin_example bash
   brew bundle install --quiet --file=./homebrew/Brewfile.core
   #+end_example

   To see the list of packages take a look at [[file+emacs:Brewfile.core][./Brewfile.core]]


** Homebrew extras

   Non-essential packages can be installed with:
     
   #+begin_example bash
   brew bundle install --quiet --file=./homebrew/Brewfile.extras
   #+end_example


** Docker Desktop

   List all deps in a given Brewfile:
   
   #+begin_src bash
     brew bundle list --cask --formula --file Brewfile.docker
   #+end_src

   #+RESULTS:
   : docker
   : docker-completion


** Cloud tools

   Cloud development tools.

   #+begin_example bash
   brew bundle install --quiet --file=./homebrew/Brewfile.cloud
   #+end_example


** Homebrew-related topics

   Review the =brew= command's help for instructions on how to cleanup
   unused dependencies and how to dump all currently installed
   formulas into a =Brewfile=:
   
   #+begin_example bash
   brew bundle --help
   #+end_example


